cv.org
* 趣味
- 海外旅行(年3回くらいヨーロッパに行きます)
- 写真(NikonD7100,レンズは50mm/f1.2がメイン？)
- プログラミング(shellscript, Elixir, Ruby, PHP)
- インターネット(IPやルーティングについて)
- オンプレでのいろいろやってみること
- お酒

* 学歴
- 2010/04 藤沢市立鵠沼中学校 入学
- 2013/03 藤沢市立鵠沼中学校 卒業
- 2013/04 東京工業高等専門学校 入学
- 2017/04 東京工業高等専門学校 4年次留年(2週目開始)
- 2019/04 東京工業高等専門学校 5年次留年(2週目開始)
- 2020/03 東京工業高等専門学校 卒業見込
- 2020/04 放送大学 入学見込,単位取得後大学院入学を希望中

* 職歴
- YYYY/MM company position
- 2015/06-2017/03 くまざわ書店 アルバイト
- 2017/06-2018/10 トヨタシティーショーケースメガウェブ ライドワン アルバイト
- 2018/11-2020/03 (株)終活ねっと エンジニア インターンシップ(業務委託契約)
- 2019/04- 獨協医科大学 実験助手

* 研究,論文,発表など
- 東京工業高等専門学校 卒業研究 BLE Beaconを用いたIoTセンサ情報収集システムの実装
http://ieicehpb.info/index.php?Kenkyukai21 発表しました
- 獨協医大,バルセロナ大,他 研究(進行中) 外足靭帯の力学的計測による再建術の有効性の検証 測定器の開発およびデータ分析にて参加 英文論文出版予定

* 大会成績
- ICTSC2019 3位 代表者
- 東京工業高等専門学校 組み込みマイスター



* 資格など
- 普通自動車運転免許証
- 2018? 基本情報処理技術者

- 小学生の時 英検8級
- 小学生の時 漢検

* 環境
** computer
*** machine
- Thinkpad x220
- Thinkpad x1 yoga
*** OS
- OpenBSD(メイン)
- FreeBSD(サーバとか)
- Windows(OfficeとDRMなコンテンツを見るとき)
- Linux(業務,たまに*BSDをサポートしていない安プランIaaSを使うとき)
*** browser
- Firefox(PC,Mobile)
モバイルでは実装が追い着いていない感+シェア薄いのですこし不便ですが、利用することはOSSへの貢献だとおもっているので使っています。
chromeを断固として使わないわけではないです。
*** home network
- Flets-east
- router: Cisco 841M
- access-point: Cisco 2700
- 電話: Cisco 1721(asterisk)
Cisco推しというわけではないのですがヤフオクで集めがち
他社の機器も導入意欲あり...
** editor
- emacs(強い主張はしないのでサーバではvi/vimも使うがそんなに詳しくない)

* skill
** mail
- OpenSMTPd
メールサーバの構築および実用
** web-backend
- php,apache,nginx,linux,aws
終活ねっとでの業務利用(月間1000万PV程度)
- OpenBSD httpd
趣味で利用 メインのOSがOpenBSDなのでつかってみています。
- Elixir,ruby,python
趣味で利用,高専の文化祭でリアルタイム,双方向性のあるシステムを作ったりしました。
** web-frontend
- Vue.js
業務利用経験有り,極めてはいない
- Elixir-LiveView
趣味でつかいはじめました。
** network
- 業務で200人程度収容のオフィスネットワークを構築しました。(ルータ:YAMAHA,AP:Cisco,IP電話と遠隔拠点間の接続を含む)
** container
- Docker
業務で利用
- FreeBSD Jail
趣味,勉強会での環境づくりに利用
** 認証,認可
- Elixirのpaseto(JWTより少し新しいトークンの規格)ライブラリのguardian_pasetoにコントリビューションした。
** 車
- 都心に住んでいるのでそんなに乗る機会もなく上手でもないですが、ドライブは好き。
