cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-13 Fri 16:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>竹内義貴</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yosh" />
</head>
<body>
<div id="content">
<h1 class="title">竹内義貴
<br />
<span class="subtitle">TAKEUCHI YOSHITAKA</span>
</h1>
<div id="outline-container-org14f1b0c" class="outline-2">
<h2 id="org14f1b0c"><span class="section-number-2">1</span> 趣味</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>海外旅行(年3回くらいヨーロッパに行きます)</li>
<li>写真(NikonD7100,レンズは50mm/f1.2がメイン？)</li>
<li>プログラミング(shellscript, Elixir, Ruby, PHP)</li>
<li>インターネット(IPやルーティングについて)</li>
<li>オンプレでのいろいろやってみること</li>
<li>お酒</li>
</ul>
</div>
</div>

<div id="outline-container-orgd49bb40" class="outline-2">
<h2 id="orgd49bb40"><span class="section-number-2">2</span> 学歴</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>2010/04 藤沢市立鵠沼中学校 入学</li>
<li>2013/03 藤沢市立鵠沼中学校 卒業</li>
<li>2013/04 東京工業高等専門学校 入学</li>
<li>2017/04 東京工業高等専門学校 4年次留年(2週目開始)</li>
<li>2019/04 東京工業高等専門学校 5年次留年(2週目開始)</li>
<li>2020/03 東京工業高等専門学校 卒業見込</li>
<li>2020/04 放送大学 入学見込,単位取得後大学院入学を希望中</li>
</ul>
</div>
</div>

<div id="outline-container-orgf53d655" class="outline-2">
<h2 id="orgf53d655"><span class="section-number-2">3</span> 職歴</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>YYYY/MM company position</li>
<li>2015/06-2017/03 くまざわ書店 アルバイト</li>
<li>2017/06-2018/10 トヨタシティーショーケースメガウェブ ライドワン アルバイト</li>
<li>2018/11-2020/03 (株)終活ねっと エンジニア インターンシップ(業務委託契約)</li>
<li>2019/04- 獨協医科大学 実験助手</li>
</ul>
</div>
</div>

<div id="outline-container-org6671ec9" class="outline-2">
<h2 id="org6671ec9"><span class="section-number-2">4</span> 研究,論文,発表など</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>東京工業高等専門学校 卒業研究 BLE Beaconを用いたIoTセンサ情報収集システムの実装</li>
</ul>
<p>
<a href="http://ieicehpb.info/index.php?Kenkyukai21">http://ieicehpb.info/index.php?Kenkyukai21</a> 発表しました
</p>
<ul class="org-ul">
<li>獨協医大,バルセロナ大,他 研究(進行中) 外足靭帯の力学的計測による再建術の有効性の検証 測定器の開発およびデータ分析にて参加 英文論文出版予定</li>
</ul>
</div>
</div>

<div id="outline-container-orge01afd9" class="outline-2">
<h2 id="orge01afd9"><span class="section-number-2">5</span> 大会成績</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>ICTSC2019 3位 代表者</li>
<li>東京工業高等専門学校 組み込みマイスター</li>
</ul>
</div>
</div>



<div id="outline-container-org9824ea9" class="outline-2">
<h2 id="org9824ea9"><span class="section-number-2">6</span> 資格など</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>普通自動車運転免許証</li>
<li>2018? 基本情報処理技術者</li>

<li>小学生の時 英検8級</li>
<li>小学生の時 漢検</li>
</ul>
</div>
</div>

<div id="outline-container-org4a3cd66" class="outline-2">
<h2 id="org4a3cd66"><span class="section-number-2">7</span> 環境</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org2905dc0" class="outline-3">
<h3 id="org2905dc0"><span class="section-number-3">7.1</span> computer</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org2d479d3" class="outline-4">
<h4 id="org2d479d3"><span class="section-number-4">7.1.1</span> machine</h4>
<div class="outline-text-4" id="text-7-1-1">
<ul class="org-ul">
<li>Thinkpad x220</li>
<li>Thinkpad x1 yoga</li>
</ul>
</div>
</div>
<div id="outline-container-org94551e0" class="outline-4">
<h4 id="org94551e0"><span class="section-number-4">7.1.2</span> OS</h4>
<div class="outline-text-4" id="text-7-1-2">
<ul class="org-ul">
<li>OpenBSD(メイン)</li>
<li>FreeBSD(サーバとか)</li>
<li>Windows(OfficeとDRMなコンテンツを見るとき)</li>
<li>Linux(業務,たまに*BSDをサポートしていない安プランIaaSを使うとき)</li>
</ul>
</div>
</div>
<div id="outline-container-org8c67167" class="outline-4">
<h4 id="org8c67167"><span class="section-number-4">7.1.3</span> browser</h4>
<div class="outline-text-4" id="text-7-1-3">
<ul class="org-ul">
<li>Firefox(PC,Mobile)</li>
</ul>
<p>
モバイルでは実装が追い着いていない感+シェア薄いのですこし不便ですが、利用することはOSSへの貢献だとおもっているので使っています。
chromeを断固として使わないわけではないです。
</p>
</div>
</div>
<div id="outline-container-orgf955e83" class="outline-4">
<h4 id="orgf955e83"><span class="section-number-4">7.1.4</span> home network</h4>
<div class="outline-text-4" id="text-7-1-4">
<ul class="org-ul">
<li>Flets-east</li>
<li>router: Cisco 841M</li>
<li>access-point: Cisco 2700</li>
<li>電話: Cisco 1721(asterisk)</li>
</ul>
<p>
Cisco推しというわけではないのですがヤフオクで集めがち
他社の機器も導入意欲あり&#x2026;
</p>
</div>
</div>
</div>
<div id="outline-container-org34f561a" class="outline-3">
<h3 id="org34f561a"><span class="section-number-3">7.2</span> editor</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>emacs(強い主張はしないのでサーバではvi/vimも使うがそんなに詳しくない)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0e5edd2" class="outline-2">
<h2 id="org0e5edd2"><span class="section-number-2">8</span> skill</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgc513ec6" class="outline-3">
<h3 id="orgc513ec6"><span class="section-number-3">8.1</span> mail</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>OpenSMTPd</li>
</ul>
<p>
メールサーバの構築および実用
</p>
</div>
</div>
<div id="outline-container-orgb529df8" class="outline-3">
<h3 id="orgb529df8"><span class="section-number-3">8.2</span> web-backend</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>php,apache,nginx,linux,aws</li>
</ul>
<p>
終活ねっとでの業務利用(月間1000万PV程度)
</p>
<ul class="org-ul">
<li>OpenBSD httpd</li>
</ul>
<p>
趣味で利用 メインのOSがOpenBSDなのでつかってみています。
</p>
<ul class="org-ul">
<li>Elixir,ruby,python</li>
</ul>
<p>
趣味で利用,高専の文化祭でリアルタイム,双方向性のあるシステムを作ったりしました。
</p>
</div>
</div>
<div id="outline-container-org035f0c7" class="outline-3">
<h3 id="org035f0c7"><span class="section-number-3">8.3</span> web-frontend</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Vue.js</li>
</ul>
<p>
業務利用経験有り,極めてはいない
</p>
<ul class="org-ul">
<li>Elixir-LiveView</li>
</ul>
<p>
趣味でつかいはじめました。
</p>
</div>
</div>
<div id="outline-container-org961e98c" class="outline-3">
<h3 id="org961e98c"><span class="section-number-3">8.4</span> network</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>業務で200人程度収容のオフィスネットワークを構築しました。(ルータ:YAMAHA,AP:Cisco,IP電話と遠隔拠点間の接続を含む)</li>
</ul>
</div>
</div>
<div id="outline-container-org90aec0f" class="outline-3">
<h3 id="org90aec0f"><span class="section-number-3">8.5</span> container</h3>
<div class="outline-text-3" id="text-8-5">
<ul class="org-ul">
<li>Docker</li>
</ul>
<p>
業務で利用
</p>
<ul class="org-ul">
<li>FreeBSD Jail</li>
</ul>
<p>
趣味,勉強会での環境づくりに利用
</p>
</div>
</div>
<div id="outline-container-org26165e8" class="outline-3">
<h3 id="org26165e8"><span class="section-number-3">8.6</span> 認証,認可</h3>
<div class="outline-text-3" id="text-8-6">
<ul class="org-ul">
<li>Elixirのpaseto(JWTより少し新しいトークンの規格)ライブラリのguardian<sub>pasetoにコントリビューションした</sub>。</li>
</ul>
</div>
</div>
<div id="outline-container-org04c955c" class="outline-3">
<h3 id="org04c955c"><span class="section-number-3">8.7</span> 車</h3>
<div class="outline-text-3" id="text-8-7">
<ul class="org-ul">
<li>都心に住んでいるのでそんなに乗る機会もなく上手でもないですが、ドライブは好き。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yosh</p>
<p class="date">Created: 2020-03-13 Fri 16:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
